OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1578.h
#define PWM2DCL0                PWM2DCLbits.PWM2DCL0            // bit 0
#define PWM2DCL1                PWM2DCLbits.PWM2DCL1            // bit 1
#define PWM2DCL2                PWM2DCLbits.PWM2DCL2            // bit 2
#define PWM2DCL3                PWM2DCLbits.PWM2DCL3            // bit 3
#define PWM2DCL4                PWM2DCLbits.PWM2DCL4            // bit 4
#define PWM2DCL5                PWM2DCLbits.PWM2DCL5            // bit 5
#define PWM2DCL6                PWM2DCLbits.PWM2DCL6            // bit 6
#define PWM2DCL7                PWM2DCLbits.PWM2DCL7            // bit 7

#define PWM2OFH0                PWM2OFHbits.PWM2OFH0            // bit 0
#define PWM2OFH1                PWM2OFHbits.PWM2OFH1            // bit 1
#define PWM2OFH2                PWM2OFHbits.PWM2OFH2            // bit 2
#define PWM2OFH3                PWM2OFHbits.PWM2OFH3            // bit 3
#define PWM2OFH4                PWM2OFHbits.PWM2OFH4            // bit 4
#define PWM2OFH5                PWM2OFHbits.PWM2OFH5            // bit 5
#define PWM2OFH6                PWM2OFHbits.PWM2OFH6            // bit 6
#define PWM2OFH7                PWM2OFHbits.PWM2OFH7            // bit 7

#define PWM2OFL0                PWM2OFLbits.PWM2OFL0            // bit 0
#define PWM2OFL1                PWM2OFLbits.PWM2OFL1            // bit 1
#define PWM2OFL2                PWM2OFLbits.PWM2OFL2            // bit 2
#define PWM2OFL3                PWM2OFLbits.PWM2OFL3            // bit 3
#define PWM2OFL4                PWM2OFLbits.PWM2OFL4            // bit 4
#define PWM2OFL5                PWM2OFLbits.PWM2OFL5            // bit 5
#define PWM2OFL6                PWM2OFLbits.PWM2OFL6            // bit 6
#define PWM2OFL7                PWM2OFLbits.PWM2OFL7            // bit 7

#define PWM2PHH0                PWM2PHHbits.PWM2PHH0            // bit 0
#define PWM2PHH1                PWM2PHHbits.PWM2PHH1            // bit 1
#define PWM2PHH2                PWM2PHHbits.PWM2PHH2            // bit 2
#define PWM2PHH3                PWM2PHHbits.PWM2PHH3            // bit 3
#define PWM2PHH4                PWM2PHHbits.PWM2PHH4            // bit 4
#define PWM2PHH5                PWM2PHHbits.PWM2PHH5            // bit 5
#define PWM2PHH6                PWM2PHHbits.PWM2PHH6            // bit 6
#define PWM2PHH7                PWM2PHHbits.PWM2PHH7            // bit 7

#define PWM2PHL0                PWM2PHLbits.PWM2PHL0            // bit 0
#define PWM2PHL1                PWM2PHLbits.PWM2PHL1            // bit 1
#define PWM2PHL2                PWM2PHLbits.PWM2PHL2            // bit 2
#define PWM2PHL3                PWM2PHLbits.PWM2PHL3            // bit 3
#define PWM2PHL4                PWM2PHLbits.PWM2PHL4            // bit 4
#define PWM2PHL5                PWM2PHLbits.PWM2PHL5            // bit 5
#define PWM2PHL6                PWM2PHLbits.PWM2PHL6            // bit 6
#define PWM2PHL7                PWM2PHLbits.PWM2PHL7            // bit 7

#define PWM2PRH0                PWM2PRHbits.PWM2PRH0            // bit 0
#define PWM2PRH1                PWM2PRHbits.PWM2PRH1            // bit 1
#define PWM2PRH2                PWM2PRHbits.PWM2PRH2            // bit 2
#define PWM2PRH3                PWM2PRHbits.PWM2PRH3            // bit 3
#define PWM2PRH4                PWM2PRHbits.PWM2PRH4            // bit 4
#define PWM2PRH5                PWM2PRHbits.PWM2PRH5            // bit 5
#define PWM2PRH6                PWM2PRHbits.PWM2PRH6            // bit 6
#define PWM2PRH7                PWM2PRHbits.PWM2PRH7            // bit 7

#define PWM2PRL0                PWM2PRLbits.PWM2PRL0            // bit 0
#define PWM2PRL1                PWM2PRLbits.PWM2PRL1            // bit 1
#define PWM2PRL2                PWM2PRLbits.PWM2PRL2            // bit 2
#define PWM2PRL3                PWM2PRLbits.PWM2PRL3            // bit 3
#define PWM2PRL4                PWM2PRLbits.PWM2PRL4            // bit 4
#define PWM2PRL5                PWM2PRLbits.PWM2PRL5            // bit 5
#define PWM2PRL6                PWM2PRLbits.PWM2PRL6            // bit 6
#define PWM2PRL7                PWM2PRLbits.PWM2PRL7            // bit 7

#define PWM2TMRH0               PWM2TMRHbits.PWM2TMRH0          // bit 0
#define PWM2TMRH1               PWM2TMRHbits.PWM2TMRH1          // bit 1
#define PWM2TMRH2               PWM2TMRHbits.PWM2TMRH2          // bit 2
#define PWM2TMRH3               PWM2TMRHbits.PWM2TMRH3          // bit 3
#define PWM2TMRH4               PWM2TMRHbits.PWM2TMRH4          // bit 4
#define PWM2TMRH5               PWM2TMRHbits.PWM2TMRH5          // bit 5
#define PWM2TMRH6               PWM2TMRHbits.PWM2TMRH6          // bit 6
#define PWM2TMRH7               PWM2TMRHbits.PWM2TMRH7          // bit 7

#define PWM2TMRL0               PWM2TMRLbits.PWM2TMRL0          // bit 0
#define PWM2TMRL1               PWM2TMRLbits.PWM2TMRL1          // bit 1
#define PWM2TMRL2               PWM2TMRLbits.PWM2TMRL2          // bit 2
#define PWM2TMRL3               PWM2TMRLbits.PWM2TMRL3          // bit 3
#define PWM2TMRL4               PWM2TMRLbits.PWM2TMRL4          // bit 4
#define PWM2TMRL5               PWM2TMRLbits.PWM2TMRL5          // bit 5
#define PWM2TMRL6               PWM2TMRLbits.PWM2TMRL6          // bit 6
#define PWM2TMRL7               PWM2TMRLbits.PWM2TMRL7          // bit 7

#define PWM3DCH0                PWM3DCHbits.PWM3DCH0            // bit 0
#define PWM3DCH1                PWM3DCHbits.PWM3DCH1            // bit 1
#define PWM3DCH2                PWM3DCHbits.PWM3DCH2            // bit 2
#define PWM3DCH3                PWM3DCHbits.PWM3DCH3            // bit 3
#define PWM3DCH4                PWM3DCHbits.PWM3DCH4            // bit 4
#define PWM3DCH5                PWM3DCHbits.PWM3DCH5            // bit 5
#define PWM3DCH6                PWM3DCHbits.PWM3DCH6            // bit 6
#define PWM3DCH7                PWM3DCHbits.PWM3DCH7            // bit 7

#define PWM3DCL0                PWM3DCLbits.PWM3DCL0            // bit 0
#define PWM3DCL1                PWM3DCLbits.PWM3DCL1            // bit 1
#define PWM3DCL2                PWM3DCLbits.PWM3DCL2            // bit 2
#define PWM3DCL3                PWM3DCLbits.PWM3DCL3            // bit 3
#define PWM3DCL4                PWM3DCLbits.PWM3DCL4            // bit 4
#define PWM3DCL5                PWM3DCLbits.PWM3DCL5            // bit 5
#define PWM3DCL6                PWM3DCLbits.PWM3DCL6            // bit 6
#define PWM3DCL7                PWM3DCLbits.PWM3DCL7            // bit 7

#define PWM3OFH0                PWM3OFHbits.PWM3OFH0            // bit 0
#define PWM3OFH1                PWM3OFHbits.PWM3OFH1            // bit 1
#define PWM3OFH2                PWM3OFHbits.PWM3OFH2            // bit 2
#define PWM3OFH3                PWM3OFHbits.PWM3OFH3            // bit 3
#define PWM3OFH4                PWM3OFHbits.PWM3OFH4            // bit 4
#define PWM3OFH5                PWM3OFHbits.PWM3OFH5            // bit 5
#define PWM3OFH6                PWM3OFHbits.PWM3OFH6            // bit 6
#define PWM3OFH7                PWM3OFHbits.PWM3OFH7            // bit 7

